<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"2dbbc9eb97422fcf8effacb78bf15db6d876be8f9cbe89f373cccbc5e5d9fe62","plan_job_ref":"Job Terraform Plan #13 at https://github.com/cal-itp/gtfs.calitp.org/actions/runs/15546384261","plan_out_hash":"f6e85ad25c724903dc495ce1fb147634e7415a7749b93188e097ee62a86a3e72","plan_hash":"92e37ff4948dbaa3bb9846837188f05a8c08d85882ef7c6535a7901d3cfecbf6","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/__
<details>
<summary>Plan: 0 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.gtfs-calitp-org["index.html"] will be updated in-place
!~  resource "google_storage_bucket_object" "gtfs-calitp-org" {
!~      crc32c              = "3QMb4A==" -> (known after apply)
!~      detect_md5hash      = "JcpLU2E/cS+rX/e81aM9qw==" -> "different hash"
!~      generation          = 1748980510715842 -> (known after apply)
        id                  = "calitp-gtfs-index.html"
!~      md5hash             = "JcpLU2E/cS+rX/e81aM9qw==" -> (known after apply)
        name                = "index.html"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.gtfs-calitp-org["sha.txt"] will be updated in-place
!~  resource "google_storage_bucket_object" "gtfs-calitp-org" {
!~      crc32c              = "dtA3XA==" -> (known after apply)
!~      detect_md5hash      = "Xj/sKaNikGXPp1DyXnXcqg==" -> "different hash"
!~      generation          = 1748981141395897 -> (known after apply)
        id                  = "calitp-gtfs-sha.txt"
!~      md5hash             = "Xj/sKaNikGXPp1DyXnXcqg==" -> (known after apply)
        name                = "sha.txt"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #13](https://github.com/cal-itp/gtfs.calitp.org/actions/runs/15546384261)